<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="Style.css">
    <title>Document</title>
</head>
<body>
<div class="header">
  <h1>Онлайн учебник</h1>
  <p>HTMLиCSS</p>
</div>

<div class="navbar">
<a href="index.php">Главная</a>
<a href="html.php">HTML</a>
<a href="css.php">CSS</a>
<a href="task.php">Задачи</a>
<a href="comm.php" class="right">Форум</a>
</div>

<div class="row">
  <div class="side">
  <h1>Разделы</h1>

  <section>
<a href="html.php"><h2>HTML</h2></a>
<p>HTML, или язык разметки гипертекста, является стандартным языком разметки для создания веб-страниц. Он обеспечивает структуру содержимого веб-страницы, такую как заголовки, абзацы и списки. HTML также включает атрибуты, определяющие поведение содержимого, такие как ссылки и изображения. </p>
<p>В этом разделе руководства мы рассмотрим основы HTML и то, как использовать его для создания веб-сайта. Мы рассмотрим различные HTML-теги и атрибуты, а также то, как их использовать для добавления контента и структуры на веб-страницу. </p>
<p>К концу этого раздела вы будете хорошо разбираться в HTML и сможете создать базовый веб-сайт, используя HTML-теги и атрибуты.</p>
</section>
<section>
<a href="css.php"><h2>CSS</h2></a>
<p>CSS, или каскадные таблицы стилей, - это язык таблиц стилей, используемый для описания внешнего вида и форматирования документа, написанного на HTML. CSS используется для управления макетом, цветом и другими визуальными элементами веб-страницы и предоставляет способ отделить представление веб-страницы от ее содержимого. </p>
<p>В этом разделе руководства мы рассмотрим основы CSS и то, как использовать его для оформления веб-сайта. Мы рассмотрим различные CSS-селекторы, свойства и значения, а также то, как их использовать для управления макетом, цветом и другими визуальными элементами веб-страницы.</p>
<p>К концу этого раздела вы будете хорошо разбираться в CSS и сможете создать профессионально выглядящий веб-сайт, используя стили CSS.</p>
</section>
<section>
<a href="task.php"><h2>Задачи</h2></a>
<p>В этом разделе вы проверите свои знания HTML и CSS, выполняя различные задания. </p>
</section>
<footer>
<p>&copy; 2023 Онлайн-учебник по HTML и CSS</p>
</footer>
</body>
</html>